{
  "Version": "1.3",
  "ID": "f1bxnh7glnd5iglrnd3hrpv2mgx7jshkbvpjz3xly",
  "Issue Number": "200",
  "Client Contract Address": "f410f2gttflowjnzcxeeop6husfjctopyvskazcmnjgi",
  "Client": {
    "Name": "CGTURBO STUDIO",
    "Region": "China",
    "Industry": "Information, Media & Telecommunications",
    "Website": "https://yw.cgturbo.cn/",
    "Social Media": "https://yw.cgturbo.cn/",
    "Social Media Type": "Slack",
    "Role": "Dataset Owner"
  },
  "Project": {
    "Brief history of your project and organization": "CGTURBO STUDIO always dedicate to solve the pain of art research and development for\ncustomers with professional and efficient art assets, reducing the cycle of the research anddevelopment, improving the quality of art.\n\nFocus makes us more professional. With the expansion of Genex of the domestic and foreign\ngame market year by year, we are blessed to be involved in the production of a large number\nof first-line projects at home and abroad. Keep our technical strength to follow up the contin-\nuous iteration of the main-trend.\n\nWe never stop exploring for Genex. Every breakthrough comes from our devotion and love.\nThe precipitation and accumulation of technology reduce the communication cost between\na large number of customers and us, which make customers less worry, more assured.",
    "Is this project associated with other projects/ecosystem stakeholders?": "No",
    "Describe the data being stored onto Filecoin": "Most are instructional videos on 3D modeling.",
    "Where was the data currently stored in this dataset sourced from": "My Own Storage Infra",
    "How do you plan to prepare the dataset": "https://github.com/filedrive-team/go-graphsplit\n\nUse the above open source tools for data packaging and deal sending with boost",
    "Please share a sample of the data (a link to a file, an image, a table, etc., are good ways to do this.)": "https://6-r.cn/jWShrYzn\nhttps://www.cgturbo.cn/#character",
    "Confirm that this is a public dataset that can be retrieved by anyone on the network (i.e., no specific permissions or access rights are required to view the data)": "[x] I confirm",
    "What is the expected retrieval frequency for this data": "Yearly",
    "For how long do you plan to keep this dataset stored on Filecoin": "More than 3 years",
    "In which geographies do you plan on making storage deals": "Greater China, Asia other than Greater China, North America, South America",
    "How will you be distributing your data to storage providers": "HTTP or FTP server, Shipping hard drives",
    "Please list the provider IDs and location of the storage providers you will be working with. Note that it is a requirement to list a minimum of 5 unique provider IDs, and that your client address will be verified against this list in the future": "f03577777  Singapore\nf03577778  Singapore\nf03567898  Shenzhen\nf03567899  Shenzhen\nf03559991 guangzhou\nf03559992 guangzhou\nf03559993 guangzhou\nf03559994 guangzhou\nf03559995 Hong Kong",
    "Can you confirm that you will follow the Fil+ guideline (Data owner should engage at least 4 SPs and no single SP ID should receive >30% of a client's allocated DataCap)": "Yes"
  },
  "Datacap": {
    "Type": "ldn-v3",
    "Data Type": "Slingshot",
    "Total Requested Amount": "10PiB",
    "Single Size Dataset": "2PiB",
    "Replicas": 5,
    "Weekly Allocation": "2PiB"
  },
  "Lifecycle": {
    "State": "ReadyToSign",
    "Validated At": "2025-12-25 09:37:35.470118299 UTC",
    "Validated By": "MikeH1999",
    "Active": true,
    "Updated At": "2025-12-25 09:37:35.470122613 UTC",
    "Active Request ID": "47c4c7d0-2062-44b3-ab3d-fcb94cdf250c",
    "On Chain Address": "f1bxnh7glnd5iglrnd3hrpv2mgx7jshkbvpjz3xly",
    "Multisig Address": "false",
    "edited": false
  },
  "Allocation Requests": [
    {
      "ID": "47c4c7d0-2062-44b3-ab3d-fcb94cdf250c",
      "Request Type": "First",
      "Created At": "2025-12-25 09:37:35.470125509 UTC",
      "Updated At": "2025-12-25 09:37:35.470126782 UTC",
      "Active": true,
      "Allocation Amount": "281474976710656 B",
      "Signers": []
    }
  ]
}