{
  "Version": 1,
  "ID": "f1ros77tqminx2v5ni3ley526333m3rdj7gg43hna",
  "Issue Number": "31",
  "Client": {
    "Name": "noaa",
    "Region": "American Samoa",
    "Industry": "Environment",
    "Website": "https://www.mty.wang",
    "Social Media": "yann",
    "Social Media Type": "Slack",
    "Role": "Dataset Owner"
  },
  "Project": {
    "Brief history of your project and organization": "Team: MTYW Team\r\n\r\nMaitian Yunwang (Hangzhou) Information Technology Co., Ltd. was established in 2020 and is a high-tech enterprise specializing in distributed data storage. It is a new force and driving force in the national new infrastructure construction team. The company takes identity authentication technology as its security infrastructure and building a distributed storage architecture as its technical roadmap, committed to independent research and application of trusted private cloud technology. The company's services are based on the Maitian Cloud Network distributed private cloud platform, utilizing advanced technologies such as big data and cloud computing to integrate government and enterprise business data, monitoring data, operational data, etc., to provide customers with end-to-end intelligent value-added services, driven by data.\r\n\r\n\r\nProject: Distributed Cloud Storage（ https://www.mty.wang/data-storage ）\r\n\r\nMNStar is a storage system independently developed by Maitian Cloud Network based on the architecture design and operational experience of object storage services. It is a stable, reliable, high-performance, and flexible elastic computing service provided by Maitian Cloud Network to customers. Customers can create and use cloud servers according to different business needs at any time, saving a lot of time and cost compared to IT hardware, while simplifying IT procurement, deployment, implementation, operation and maintenance work. Capable of building hundreds of EB level highly reliable, secure, low-cost, and scalable business systems for customers to meet diverse unstructured data storage needs.",
    "Is this project associated with other projects/ecosystem stakeholders?": "No",
    "Describe the data being stored onto Filecoin": "The data stored in Filecoin is from publicly available datasets with important information for environments via NOAA.",
    "Where was the data currently stored in this dataset sourced from": "AWS Cloud",
    "How do you plan to prepare the dataset": "We use go-graphsplit to split a large dataset into graph slices to make deals.\r\nstorage and retrieval use droplet",
    "Please share a sample of the data (a link to a file, an image, a table, etc., are good ways to do this.)": "https://registry.opendata.aws/noaa-gmgsi/\r\ns3://noaa-gmgsi-pds/\r\nhttps://registry.opendata.aws/noaa-coastal-lidar/\r\ns3://noaa-nos-coastal-lidar-pds/\r\nhttps://registry.opendata.aws/noaa-ghe/\r\ns3://noaa-ghe-pds/\r\nhttps://registry.opendata.aws/noaa-s111/\r\ns3://noaa-s111-pds/\r\ns3://noaa-ufs-prototypes-pds/\r\nhttps://registry.opendata.aws/noaa-ghcn/\r\ns3://noaa-ghcn-pds/\r\nhttps://registry.opendata.aws/noaa-rtofs/\r\ns3://noaa-nws-rtofs-pds/",
    "Confirm that this is a public dataset that can be retrieved by anyone on the network (i.e., no specific permissions or access rights are required to view the data)": "[X] I confirm",
    "What is the expected retrieval frequency for this data": "Weekly",
    "For how long do you plan to keep this dataset stored on Filecoin": "1.5 to 2 years",
    "In which geographies do you plan on making storage deals": "Greater China, North America",
    "How will you be distributing your data to storage providers": "Cloud storage (i.e. S3)",
    "Please list the provider IDs and location of the storage providers you will be working with. Note that it is a requirement to list a minimum of 5 unique provider IDs, and that your client address will be verified against this list in the future": "1. f01934215, lijiang\r\n2. f01904929, Wuzhen\r\n3. f02057286, US\r\n4. f01915051, hangzhou\r\n5. f01901765, China",
    "Can you confirm that you will follow the Fil+ guideline (Data owner should engage at least 4 SPs and no single SP ID should receive >30% of a client's allocated DataCap)": "Yes"
  },
  "Datacap": {
    "Type": "ldn-v3",
    "Data Type": "Slingshot",
    "Total Requested Amount": "1PiB",
    "Single Size Dataset": "200TiB",
    "Replicas": 5,
    "Weekly Allocation": "200TiB"
  },
  "Lifecycle": {
    "State": "ReadyToSign",
    "Validated At": "2024-05-16 02:44:07.604697430 UTC",
    "Validated By": "MikeH1999",
    "Active": true,
    "Updated At": "2024-06-03 09:46:25.250851149 UTC",
    "Active Request ID": "b99f4147-505a-4fe4-8f7b-839f7e8e1b85",
    "On Chain Address": "f1ros77tqminx2v5ni3ley526333m3rdj7gg43hna",
    "Multisig Address": "false",
    "edited": false
  },
  "Allocation Requests": [
    {
      "ID": "43081a16-d110-4cce-a6cd-38534291db97",
      "Request Type": "First",
      "Created At": "2024-05-16 02:44:07.604704117 UTC",
      "Updated At": "2024-05-16 02:44:07.604705146 UTC",
      "Active": false,
      "Allocation Amount": "50TiB",
      "Signers": [
        {
          "Github Username": "MikeH1999",
          "Signing Address": "f1uci7zkbdvscvu5mklxwwafkqqn7qo7rwc6rfoxi",
          "Created At": "2024-05-20 02:16:44.012000000 UTC",
          "Message CID": "bafy2bzaceabmfqwl3i4duolblzjf4gtlxlsntz22sui4ljpbajhvp7s6y6yhm"
        }
      ]
    },
    {
      "ID": "b99f4147-505a-4fe4-8f7b-839f7e8e1b85",
      "Request Type": "Refill",
      "Created At": "2024-06-03 09:46:25.250857514 UTC",
      "Updated At": "2024-06-03 09:46:25.250858807 UTC",
      "Active": true,
      "Allocation Amount": "100TiB",
      "Signers": []
    }
  ]
}